# Задайте строку из набора чисел. Напишите программу, которая покажет большее и
# меньшее число. В качестве символа-разделителя используйте пробел.

list = [6, 8, -3, 5, 3, 6, 0]
print(max(list), min(list))
